tutorials/cfdemSolverPisoMS/ErgunTestMPI/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.1);

boundaryField
{

    wall
    {
        type            slip;
    }

    inlet
    {
        type            uniformFixedValue;
        uniformValue     table
        (
        (0.000 (0 0 0.))
        (0.099 (0 0 2))
        (0.100 (0 0 2))
        );
    }
    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
